---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.CannotLockThisDimension
source: html/fc2416ab-309b-228e-81e8-8c897e29fdf7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.CannotLockThisDimension Property

Can't lock this Dimension because it breaks formulas

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotLockThisDimension { get; }
```